app/controllers/api/v1/sessions_controller.rb

  def create
    # logger.info "Request parameters: #{params.inspect}"
    # puts "CSRF token received: #{params[:authenticity_token]}"
    # request.env["devise.mapping"] = Devise.mappings[:user] # Added this line
    user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sdf"], ["LIMIT", 1]]